# Series

In [1]:
import pandas as pd

시리즈: 컬럼 + 인덱스 형식으로 저장, 관리, 리스트/배열과 유사한 형태
* 컬럼 : 1차원 데이터 - 1개 컬럼
* 컬럼들 > 데이터프레임

데이터프레임: 컬럼들 + 인덱스, 엑셀 표(테이블) 유사한 형태

In [2]:
s1 = pd.Series([10, 20, 30]) # __init__(self, 리스트객체)
s1
#s1[0:2]

0    10
1    20
2    30
dtype: int64

In [3]:
col_idx = ['A', 'B', 'C']
data = [10, 20, 30]
s2 = pd.Series(data, index=col_idx)
s2 #판다스 데이터타입 dtype

A    10
B    20
C    30
dtype: int64

In [4]:
s2[0] #[] >>> 인덱싱 표식

C:\Users\Admin\AppData\Local\Temp\ipykernel_14816\1816419225.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0] #[] >>> 인덱싱 표식

np.int64(10)

In [5]:
s2[0:3] #index 0부터 끝(-1) > 순서기반인덱스

A    10
B    20
C    30
dtype: int64

In [6]:
s2['A':'C'] #슬라이싱, 인덱스이름기반 추출

A    10
B    20
C    30
dtype: int64

In [7]:
dict_data = {'A':10, 'B':20, 'C':30} #딕셔너리 키 = 시리즈 인덱스
dict_data
s3 = pd.Series(dict_data)

In [8]:
s3

A    10
B    20
C    30
dtype: int64

In [9]:
s3.dtypes #객체의 속성

dtype('int64')

In [10]:
s3.info() #객체의 메서드

<class 'pandas.core.series.Series'>
Index: 3 entries, A to C
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [11]:
population = pd.Series([9776.0, 2729, 1566, 3158],  #하나만 소수점으로 변경해도 모두 다 변경됨(numpy의 속성 - pandas는 numpy를 상속받았기 때문)
                    index=['서울', '부산', '인천', '대구'])
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
dtype: float64

In [12]:
print(population['서울'])  # 9776 출력

print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776.0
서울    9776.0
부산    2729.0
dtype: float64

In [13]:
population[['서울', '인천']]

서울    9776.0
인천    1566.0
dtype: float64

In [14]:
population[['서울','대구']]

서울    9776.0
대구    3158.0
dtype: float64

In [15]:
population['제주']= 20 #새로운 행 추가

In [16]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      20.0
dtype: float64

In [17]:
import numpy as np

In [18]:
#리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [19]:
pd.DataFrame(data, columns=['A', 'B', 'C'], index=['홍길동', '김삿갓', '황진이'])

     A  B  C
홍길동  1  2  3
김삿갓  4  5  6
황진이  7  8  9

In [20]:
import numpy as np
import pandas as pd

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [21]:
pd.DataFrame(arr, columns=['A', 'B', 'C'], index=['홍길동', '김삿갓', '황진이'])

     A  B  C
홍길동  1  2  3
김삿갓  4  5  6
황진이  7  8  9

In [22]:
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])
names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [23]:
# pd.DataFrame([names, ages,scores]) >> 잘못된 사용
pd.DataFrame({
  '이름':names,
  '나이':ages,
  '점수':scores
  })

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [82]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

In [83]:
#인덱스 지정
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [84]:
df

    이름  나이  점수
A  김철수  25  85
B  이영희  28  92
C  박민수  22  78
D  정수진  31  95
E  최영호  27  88
F  한미래  24  73
G  윤지원  29  91

In [85]:
#컬럼 변경
df.columns = ['name', 'age', 'score'] #replace

In [86]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [87]:
df.rename(columns={'name':'이름'}) #before:after 지정해서 변경, BUT 임시변경

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [88]:
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [29]:
#df.rename(columns={'name':'이름'}, inplace=True) #완전히 변경됨(원본변경)-> 비추

inplace >> 새로운 df 복사본에서 확인하는 방법이 안전

In [30]:
df1 = df.rename(columns={'name':'이름'}) #새로운 변수에 받아서 쓰면 안전

In [31]:
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [32]:
#미리보기
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [33]:
df.head(3) #default 5개

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [34]:
df.tail(3)

  name  age  score
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [35]:
df.describe()

             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

# 인덱싱

[] 인덱싱

- iloc[] 행기반 인덱싱 >>> [행,열]
- loc[] 이름기반(위치) 인덱싱 >>> [행이름,열이름]

- : >> start:end까지 슬라이싱
- loc[행이름:행이름]
- iloc[행번호:행번호] >>> end 행번호는 -1 까지

In [36]:
#df1[['이름', 'age']]
df1.loc[:,['이름', 'age']]  #loc는 행과 열을 모두 지정해주어야 함 >> loc[행, 열]

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29

In [37]:
df1.loc['A']  #행만 꺼내면 Series로 나옴

이름       김철수
age       25
score     85
Name: A, dtype: object

In [38]:
df1.iloc[0:3, 0:2] #행 번호, 열 번호 (,를 기준으로 행과 열을 지정함) (:은 start:end(-1))

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22

# 연습문제

[기본]

In [39]:
df1.loc[:,'이름']

A    김철수
B    이영희
C    박민수
D    정수진
E    최영호
F    한미래
G    윤지원
Name: 이름, dtype: object

In [40]:
df1.loc[:,['이름','score']]

    이름  score
A  김철수     85
B  이영희     92
C  박민수     78
D  정수진     95
E  최영호     88
F  한미래     73
G  윤지원     91

In [41]:
df1.loc['C']

이름       박민수
age       22
score     78
Name: C, dtype: object

In [42]:
df1.loc['D',['age']]

age    31
Name: D, dtype: object

[슬라이싱]

In [43]:
df1.loc['B':'E']

    이름  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [44]:
df1.loc['C':'F', ['age']]

   age
C   22
D   31
E   27
F   24

In [45]:
df1.loc['A':'G', ['score']]

   score
A     85
B     92
C     78
D     95
E     88
F     73
G     91

# boolean 인덱싱

[조건 + loc]

In [46]:
df['score'] > 90 #vectorization

A    False
B     True
C    False
D     True
E    False
F    False
G     True
Name: score, dtype: bool

In [47]:
df [df['score'] > 90] #boolean list의 요소값 True, False에서 True인 값들만 꺼냄

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [48]:
cond = df1['age']>=27

In [49]:
df1.loc[cond]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
E  최영호   27     88
G  윤지원   29     91

In [50]:
con1 = df1['score'] >=90

In [51]:
df1.loc[con1, ['이름','score']]

    이름  score
B  이영희     92
D  정수진     95
G  윤지원     91

In [52]:
df1.loc[df1['score']>=90, ['이름', 'score']]

    이름  score
B  이영희     92
D  정수진     95
G  윤지원     91

In [53]:
con2 = df1['age'] >=25
sco2 = df1['score'] >=90

In [54]:
df1.loc[con1 & sco2]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

iloc 인덱싱 & 슬라이싱 연습문제
정수 위치 기반 (0부터 시작)

[기본]

In [55]:
df1.iloc[0,:]

이름       김철수
age       25
score     85
Name: A, dtype: object

In [56]:
df1.iloc[2, 0]

'박민수'

In [57]:
df1.iloc[0:3]

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [58]:
df1.head(3)

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [59]:
df1.tail(1).iloc[:,2]

G    91
Name: score, dtype: int64

In [60]:
df1.iloc[-1, 2]

np.int64(91)

[슬라이싱]

In [61]:
df1.iloc[1:5]

    이름  age  score
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

In [62]:
df1.iloc[2:6, 0:2]

    이름  age
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [63]:
df1.iloc[:, 1]

A    25
B    28
C    22
D    31
E    27
F    24
G    29
Name: age, dtype: int64

[조합 문제]

In [64]:
df1.head(4).loc[:,['score']]

   score
A     85
B     92
C     78
D     95

In [65]:
df1.loc['A':'D',['score']]

   score
A     85
B     92
C     78
D     95

In [66]:
df1.iloc[:4, 2]

A    85
B    92
C    78
D    95
Name: score, dtype: int64

In [67]:
df1.tail(3).loc[:,['이름','score']]

    이름  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [68]:
df1.iloc[-3:,::2]

    이름  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [69]:
df1.iloc[-3:, [0,2]]

    이름  score
E  최영호     88
F  한미래     73
G  윤지원     91

In [70]:
df1.iloc[[0, 2, 4, 6]]

    이름  age  score
A  김철수   25     85
C  박민수   22     78
E  최영호   27     88
G  윤지원   29     91

# 행 추가와 열 추가

In [71]:
df1.loc['H'] = ['장민호', 26, 88]

In [72]:
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91
H  장민호   26     88

In [73]:
df1['grade'] = ['A','B','A','A','B','C','A','C']

In [74]:
df1

    이름  age  score grade
A  김철수   25     85     A
B  이영희   28     92     B
C  박민수   22     78     A
D  정수진   31     95     A
E  최영호   27     88     B
F  한미래   24     73     C
G  윤지원   29     91     A
H  장민호   26     88     C

In [75]:
df1.insert(loc=1, column='student_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007','S008'])

In [76]:
df1

    이름 student_id  age  score grade
A  김철수       S001   25     85     A
B  이영희       S002   28     92     B
C  박민수       S003   22     78     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

# 행 삭제와 열 삭제

In [77]:
df1.drop('A', axis=0)

    이름 student_id  age  score grade
B  이영희       S002   28     92     B
C  박민수       S003   22     78     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

In [78]:
df1.drop(['B','C'], axis=0)

    이름 student_id  age  score grade
A  김철수       S001   25     85     A
D  정수진       S004   31     95     A
E  최영호       S005   27     88     B
F  한미래       S006   24     73     C
G  윤지원       S007   29     91     A
H  장민호       S008   26     88     C

In [79]:
df1.drop('grade',axis=1)

    이름 student_id  age  score
A  김철수       S001   25     85
B  이영희       S002   28     92
C  박민수       S003   22     78
D  정수진       S004   31     95
E  최영호       S005   27     88
F  한미래       S006   24     73
G  윤지원       S007   29     91
H  장민호       S008   26     88

In [80]:
df1.drop(['age','score'],axis=1)

    이름 student_id grade
A  김철수       S001     A
B  이영희       S002     B
C  박민수       S003     A
D  정수진       S004     A
E  최영호       S005     B
F  한미래       S006     C
G  윤지원       S007     A
H  장민호       S008     C